
console.log ('number' + 3 + 3) // number33 - 'number' це рядок, разом з оператором "+" проводить конкатенацію.
//  числа 3 і 3 перетворюється на '3' і через конкантенацію з рядком отримуємо 'number33'
console.log (null + 3) // 3 - js перетворює null в числове значення, тому воно рівне 0. в результаті маємо 0 + 3 = 3
console.log (5 && "qwerty") // qwerty - оператор && - логічний оператор, який повертає тру, якщо обидва операнди тру. число 5 буде тру, бо має значення, а рядок наводиться до тру
console.log (+'40' + +'2' + "hillel") // 42hillel - + перед '40' перетворить рядок в число, тому маємо 40. те ж саме з +'2', маємо 42. і потім конкат з рядком 42 + "hillel"
console.log ('10' - 5 === 6) // false - маємо рядок '10' та число 5. оператор "-" робить числове перетворення, тому що "-" тільки арифметичний оператор і маємо 10 - 5 = 5.
// після цього строге порівняння === з числом 6. оскільки не сходиться маємо false
console.log (true + false) // 1 - оператор true = 1, оператор false = 0. + в даному випадку арифм. оператор тому маємо 1 + 0
console.log ('4px' - 3) // NaN - js при операторі - хоче перетворити рядок 4px в число, але не може привести його до числа і отримуємо NaN.
//  і відповідно NaN - 3 дає нам результат NaN через неможливість проведення операції з не числом
console.log ('4' - 3) // 1 - рядок '4' через оператор "-" приводиться до числа і стає 4. 4 - 3 дає 1
console.log ('6' + 3 ** 0) // 61 - маємо 3 в степені 0, яке при обчисленні дасть 1. але перший оператор у нас рядок '6' і тому js маючи + робить конкат
console.log (12 / '6') // 2 - оператор "/" - арифметичний оператор. js приводить рядок '6' до числового значення через наявний арифм.оператор і маємо ділення 12 на 6
console.log ('10' + (5 === 6)) // 10false - перше виконуємо дію в дужках, строге порівняння яке дає false. потім через те, що + з рядками робить конкантенацію отримуємо 10false
console.log (null == '') // false - особливе правило при якому тільки null == undefined = true, всі інші null == буде false.
console.log (3 ** (9 / 3)) // 27 - арифметична дія в дужках 9/3 = 3. тоді приводимо число 3 до степеню 3
console.log (!!'false' == !!'true') // true - !! перетворює до boolean. тому маємо рядок !!'false' - true, та !!'true' - true. при порівнянні отримаємо true
console.log (0 || '0' && 1) // 1 - маємо не пустий рядок '0' = true. при '0' && 1 маємо 1, тому що обидва true, і повертається останнє значення 1.
//  тоді при 0 || 1 маємо 1, тому що оператор || повертає true якщо один із них тру.
console.log ((+null == false) < 1) // false - +null перетворить в 0, а 0 = false. звідси маємо false == false = true. а true = 1, і при порівняння true(1) < 1 отримаємо false
console.log (false && true || true) // true - оператор && повертає true тільки якщо обидва будуть true, інакше припиняє обчислення якщо є false, тому отримуємо false && true = false.
// а || повертає true якщо є хоч один тру. тому при false || true = true.
console.log (false && (false || true)) // false - маємо false || true де оператор поверне нам тру, якщо є хоч один тру. далі false && true - false, тому що при && закінчується обчислення на false.
console.log ((+null == false) < 1 ** 5) // false - маємо +null = 0, та false який також 0, тому +null == false = true. тоді дивимось true < 1**5. 1**5 = 1. true = 1.
// тому true(1)<1 = false.